app/Http/Controllers/Api/AuthController.php

        try
        {
            // update Or Create user
            $user = User::where( 'mobile', $validated['country_code'] . $validated['mobile_phone_number'] )->first();
---
select * from `users` where `mobile` = '+989361230090' and `users`.`deleted_at` is null limit 1