app/Http/Controllers/NormalProductController.php

        );

        // todo shopkeeper have shop
        $shopsAndRolesFromPivot = RolesShopsUsers::where('user_id', $user_id)->where('shop_id', $validated['product_shop_id'])->get();
        $shopsAndRolesFromPivot->filter(function ($value, $key) {
            $role = Role::where('id', $value->role_id)->where('guard_name', 'api')->first();
            if (!$role->name == 'shopkeeper')
            {
                dd('ee');
            }
        });
---
select * from `roles_shops_users` where `user_id` = 3 and `shop_id` = '3' and `roles_shops_users`.`deleted_at` is null
select * from `roles` where `id` = 1 and `guard_name` = 'api' limit 1



                $normalProduct->product_index_image_url = $normalProduct_image_url;
                $normalProduct->save();
---
update `normal_products` set `product_index_image_url` = 'shop/shop_id/3_normal_product_id_5_normal_product_name_test/shop-2021-12-08-09-12.jpeg', `normal_products`.`updated_at` = '2021-12-08 09:38:44' where `id` = 5