app/Http/Controllers/ProductCategoryController.php

select * from `product_categories` where `product_categories`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `product_categories` where (`product_category_accept_status` = 1 or (`product_category_accept_status` = 0 and `product_category_additional_user_id` = 3)) and `product_categories`.`deleted_at` is null
---
    public function index(Request $request)
    {
        dd($request);
        $user = auth()->user();
        $user_id = $user->id;
        $this->checkQueryParams( $request );

        $productCategories = ProductCategory::orderBy( $this->sort, $this->order )
            ->when( $user->hasRole( 'system', 'api' ), function ($query) use ($user_id) {
                return $query
                    ->where( 'product_category_accept_status', 1 )
                    ->orWhere( 'product_category_accept_status', 0 )
                    ->orWhereNull( 'product_category_accept_status' );
            } )
            ->when( $user->hasRole( 'shopkeeper', 'api' ), function ($query) use ($user_id) {
                return $query
                    ->where( 'product_category_accept_status', 1 )
                    ->orWhere( function ($subQuery) use ($user_id) {
                        $subQuery
                            ->where( 'product_category_accept_status', 0 )
                            ->Where( 'product_category_additional_user_id', $user_id );
                    } );
            } )
            ->when( $user->hasRole( 'user', 'api' ), function ($query) use ($user_id) {
                return $query
//                    ->select()
                    ->where( 'product_category_accept_status', 1 )
                    ->where( 'product_category_publish_status', 1 );
            } )
            ->paginate( $this->limit, '*', 'page', $this->page );