app/Http/Controllers/shopController.php

insert into `roles_shops_users` (`role_id`, `shop_id`, `shop_type`, `user_id`) values (1, 4, 'child', 3)
---
            }
            auth()->user()->guard_name = 'api';
            auth()->user()->assignRole('shopkeeper');
            $shop->userOfRolesShopsUsers()->attach( $shopkeeper_id, ['shop_type' => 'child', 'role_id' => 1] );