app/Repositories/ShopRepositories.php

    public function getByShopId($id)
    {
        $shopkeeper_id = auth()->id();
        $shop = Shop::whereHas('userOfRolesShopsUsers', function ($query) use ($shopkeeper_id) {
            $query->where('roles_shops_users.user_id', '=', $shopkeeper_id);
        })
            ->where('id', '=', (int)$id) // for get all remove this line
            ->with('userOfRolesShopsUsers')
            ->with('roleOfRolesShopsUsers')
            ->first();
---
select * from `shops` where exists (select * from `users` inner join `roles_shops_users` on `users`.`id` = `roles_shops_users`.`user_id` where `shops`.`id` = `roles_shops_users`.`shop_id` and `roles_shops_users`.`user_id` = 3 and `users`.`deleted_at` is null) and `id` = 1 and `shops`.`deleted_at` is null limit 1
select `users`.*, `roles_shops_users`.`shop_id` as `pivot_shop_id`, `roles_shops_users`.`user_id` as `pivot_user_id` from `users` inner join `roles_shops_users` on `users`.`id` = `roles_shops_users`.`user_id` where `roles_shops_users`.`shop_id` in (1) and `users`.`deleted_at` is null